# -*- coding: utf-8 -*-

from django.test import TestCase
from 臺灣言語平臺.項目模型 import 平臺項目表
from 臺灣言語資料庫.資料模型 import 來源表


class 揣外語的其他建議試驗(TestCase):

    def setUp(self):
        self.鄉民 = 來源表. 加來源({"名": '鄉民', '出世年': '1950', '出世地': '臺灣', })

    def test_揣無(self):
        # 		前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '水母'
        })
# 		前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'], [])

    def test_無文本當做揣無(self):
        self.資料庫加外語('水母')
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '水'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'], [])

    def test_文本無建議用字當做揣無(self):
        水母編號 = self.資料庫加外語('水母')
        平臺項目表.外語翻母語(水母編號, {
            '文本資料': '水母',
        })
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '水'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'], [])

    def test_文本有建議用字就揣會著(self):
        水母編號 = self.資料庫加外語('水母')
        文本 = 平臺項目表.外語翻母語(水母編號, {
            '文本資料': '䖳',
        })
        文本.設為推薦用字()
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '水'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'][0]['文本資料'], '䖳')

    def test_文本有閣校對過就揣會著(self):
        漂亮編號 = self.資料庫加外語('漂亮')
        文本 = 平臺項目表.外語翻母語(漂亮編號, {
            '文本資料': '3',
        })
        新文本 = 平臺項目表._校對母語文本(文本.編號(), {
            '文本資料': '媠',
            '屬性': {'音標': 'sui2'}
        })
        新文本.設為推薦用字()
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '漂'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'][0]['文本資料'], '媠')

    def test_一擺提著對應華語(self):
        漂亮編號 = self.資料庫加外語('漂亮')
        文本 = 平臺項目表.外語翻母語(漂亮編號, {
            '文本資料': '3',
        })
        新文本 = 平臺項目表._校對母語文本(文本.編號(), {
            '文本資料': '媠',
            '屬性': {'音標': 'sui2'}
        })
        新文本.設為推薦用字()
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '漂'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'][0]['按呢講的外語列表'][0]['外語資料'], '漂亮')

    def test_文本有兩組建議用字(self):
        水母編號 = self.資料庫加外語('水母')
        文本 = 平臺項目表.外語翻母語(水母編號, {
            '文本資料': '䖳',
        })
        文本.設為推薦用字()
        文本 = 平臺項目表.外語翻母語(水母編號, {
            '文本資料': '水母',
        })
        文本.設為推薦用字()
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '水'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(len(回應資料['其他建議']), 2)

    def test_其他建議愛有相關(self):
        self.資料庫加外語('水母')
        水母腦編號 = self.資料庫加外語('水母腦')
        水母腦文本 = 平臺項目表.外語翻母語(水母腦編號, {
            '文本資料': '水母腦',
        })
        水母腦文本.設為推薦用字()
        水母國編號 = self.資料庫加外語('水母國')
        水母國文本 = 平臺項目表.外語翻母語(水母國編號, {
            '文本資料': '水母國',
        })
        水母國文本.設為推薦用字()
        self.資料庫加外語('握手')
# 		前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '水母'
        })
# 		前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(len(回應資料['其他建議']), 2)

    def test_仝款傳一个就好(self):
        漂亮編號 = self.資料庫加外語('好漂亮')
        文本 = 平臺項目表.外語翻母語(漂亮編號, {
            '文本資料': '3',
        })
        新文本 = 平臺項目表._校對母語文本(文本.編號(), {
            '文本資料': '媠',
            '音標資料': 'sui2',
        })
        新文本.設為推薦用字()
        好看編號 = self.資料庫加外語('好看')
        文本 = 平臺項目表.外語翻母語(好看編號, {
            '文本資料': '媠',
            '音標資料': 'sui2',
        })
        文本.設為推薦用字()
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '好'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'][0]['文本資料'], '媠')

    def test_佮母語仝款就回傳(self):
        漂亮編號 = self.資料庫加外語('好漂亮')
        文本 = 平臺項目表.外語翻母語(漂亮編號, {
            '文本資料': '媠',
            '音標資料': 'sui2',
        })
        文本.設為推薦用字()
#         前端輸入
        回應 = self.client.get('/平臺項目列表/揣列表', {
            '關鍵字': '媠'
        })
#         前端回傳結果
        self.assertEqual(回應.status_code, 200)
        回應資料 = 回應.json()
        self.assertEqual(回應資料['其他建議'][0]['文本資料'], '媠')

    def 資料庫加外語(self, 外語詞):
        return 平臺項目表.加外語資料(
            {
                '外語資料': 外語詞,
            }
        ).編號()

    def 外語有建議的文本(self, 外語編號):
        文本 = 平臺項目表.外語翻母語(外語編號, {
            '文本資料': 'the7',
        })
        文本.推薦用字 = True
        文本.save()
